JFDuval/FlexSEA/manage/src/fm_stm32f4xx_hal_spi.c
/** @defgroup SPI_Group1 Initialization and de-initialization functions 
 *  @brief    Initialization and Configuration functions 
 *
@verbatim
 ===============================================================================
              ##### Initialization and de-initialization functions #####
 ===============================================================================
    [..]  This subsection provides a set of functions allowing to initialize and 
          de-initialiaze the SPIx peripheral:

      (+) User must implement HAL_SPI_MspInit() function in which he configures 
          all related peripherals resources (CLOCK, GPIO, DMA, IT and NVIC ).

      (+) Call the function HAL_SPI_Init() to configure the selected device with 
          the selected configuration:
        (++) Mode
        (++) Direction 
        (++) Data Size
        (++) Clock Polarity and Phase
        (++) NSS Management
        (++) BaudRate Prescaler
        (++) FirstBit
        (++) TIMode
        (++) CRC Calculation
        (++) CRC Polynomial if CRC enabled

      (+) Call the function HAL_SPI_DeInit() to restore the default configuration 
          of the selected SPIx periperal.       

@endverbatim
 * @{
 */

/**
 * @brief  Initializes the SPI according to the specified parameters
 *         in the SPI_InitTypeDef and create the associated handle.
 * @param  hspi: pointer to a SPI_HandleTypeDef structure that contains
 *                the configuration information for SPI module.
 * @retval HAL status
 */
HAL_StatusTypeDef HAL_SPI_Init(SPI_HandleTypeDef *hspi)
{
	/* Check the SPI handle allocation */
	if(hspi == NULL)
	{
		return HAL_ERROR;
	}

	/* Check the parameters */
	assert_param(IS_SPI_MODE(hspi->Init.Mode));
	assert_param(IS_SPI_DIRECTION_MODE(hspi->Init.Direction));
	assert_param(IS_SPI_DATASIZE(hspi->Init.DataSize));
	assert_param(IS_SPI_CPOL(hspi->Init.CLKPolarity));
	assert_param(IS_SPI_CPHA(hspi->Init.CLKPhase));
	assert_param(IS_SPI_NSS(hspi->Init.NSS));
	assert_param(IS_SPI_BAUDRATE_PRESCALER(hspi->Init.BaudRatePrescaler));
	assert_param(IS_SPI_FIRST_BIT(hspi->Init.FirstBit));
	assert_param(IS_SPI_TIMODE(hspi->Init.TIMode));
	assert_param(IS_SPI_CRC_CALCULATION(hspi->Init.CRCCalculation));
	assert_param(IS_SPI_CRC_POLYNOMIAL(hspi->Init.CRCPolynomial));

	if(hspi->State == HAL_SPI_STATE_RESET)
	{
		/* Init the low level hardware : GPIO, CLOCK, NVIC... */
		HAL_SPI_MspInit(hspi);
	}

	hspi->State = HAL_SPI_STATE_BUSY;

	/* Disble the selected SPI peripheral */
	__HAL_SPI_DISABLE(hspi);

	/*----------------------- SPIx CR1 & CR2 Configuration ---------------------*/
	/* Configure : SPI Mode, Communication Mode, Data size, Clock polarity and phase, NSS management,
  Communication speed, First bit and CRC calculation state */
	hspi->Instance->CR1 = (hspi->Init.Mode | hspi->Init.Direction | hspi->Init.DataSize |
			hspi->Init.CLKPolarity | hspi->Init.CLKPhase | (hspi->Init.NSS & SPI_CR1_SSM) |
			hspi->Init.BaudRatePrescaler | hspi->Init.FirstBit  | hspi->Init.CRCCalculation);

	/* Configure : NSS management */
	hspi->Instance->CR2 = (((hspi->Init.NSS >> 16) & SPI_CR2_SSOE) | hspi->Init.TIMode);

	/*---------------------------- SPIx CRCPOLY Configuration ------------------*/
	/* Configure : CRC Polynomial */
	hspi->Instance->CRCPR = hspi->Init.CRCPolynomial;

	/* Activate the SPI mode (Make sure that I2SMOD bit in I2SCFGR register is reset) */
	hspi->Instance->I2SCFGR &= (uint32_t)(~SPI_I2SCFGR_I2SMOD);

	hspi->ErrorCode = HAL_SPI_ERROR_NONE;
	hspi->State = HAL_SPI_STATE_READY;

	return HAL_OK;
}

/**
 * @brief  DeInitializes the SPI peripheral
 * @param  hspi: pointer to a SPI_HandleTypeDef structure that contains
 *                the configuration information for SPI module.
 * @retval HAL status
 */
HAL_StatusTypeDef HAL_SPI_DeInit(SPI_HandleTypeDef *hspi)
{
	/* Check the SPI handle allocation */
	if(hspi == NULL)
	{
		return HAL_ERROR;
	}

	/* Disable the SPI Peripheral Clock */
	__HAL_SPI_DISABLE(hspi);

	/* DeInit the low level hardware: GPIO, CLOCK, NVIC... */
	HAL_SPI_MspDeInit(hspi);

	hspi->ErrorCode = HAL_SPI_ERROR_NONE;
	hspi->State = HAL_SPI_STATE_RESET;

	/* Release Lock */
	__HAL_UNLOCK(hspi);

	return HAL_OK;
}

// [ILG]
#if defined ( __GNUC__ )
#pragma GCC diagnostic push
#pragma GCC diagnostic ignored "-Wunused-parameter"
#endif

/**
 * @brief SPI MSP Init
 * @param  hspi: pointer to a SPI_HandleTypeDef structure that contains
 *                the configuration information for SPI module.
 * @retval None
 */
__weak void HAL_SPI_MspInit(SPI_HandleTypeDef *hspi)
{
	/* NOTE : This function Should not be modified, when the callback is needed,
            the HAL_SPI_MspInit could be implenetd in the user file
	 */
}

/**
 * @brief SPI MSP DeInit
 * @param  hspi: pointer to a SPI_HandleTypeDef structure that contains
 *                the configuration information for SPI module.
 * @retval None
 */
__weak void HAL_SPI_MspDeInit(SPI_HandleTypeDef *hspi)
{
	/* NOTE : This function Should not be modified, when the callback is needed,
            the HAL_SPI_MspDeInit could be implenetd in the user file
	 */
}

// [ILG]
#if defined ( __GNUC__ )
#pragma GCC diagnostic pop
#endif

/**
 * @}
 */

/** @defgroup SPI_Group2 IO operation functions
 *  @brief   Data transfers functions
 *
@verbatim
  ==============================================================================
                      ##### IO operation functions #####
 ===============================================================================
    This subsection provides a set of functions allowing to manage the SPI
    data transfers.

    [..] The SPI supports master and slave mode :

    (#) There are two modes of transfer:
       (++) Blocking mode: The communication is performed in polling mode.
            The HAL status of all data processing is returned by the same function
            after finishing transfer.
       (++) No-Blocking mode: The communication is performed using Interrupts
           or DMA, These APIs return the HAL status.
           The end of the data processing will be indicated through the 
           dedicated SPI IRQ when using Interrupt mode or the DMA IRQ when 
           using DMA mode.
           The HAL_SPI_TxCpltCallback(), HAL_SPI_RxCpltCallback() and HAL_SPI_TxRxCpltCallback() user callbacks 
           will be executed respectivelly at the end of the transmit or Receive process
           The HAL_SPI_ErrorCallback()user callback will be executed when a communication error is detected

    (#) Blocking mode APIs are :
        (++) HAL_SPI_Transmit()in 1Line (simplex) and 2Lines (full duplex) mode
        (++) HAL_SPI_Receive() in 1Line (simplex) and 2Lines (full duplex) mode
        (++) HAL_SPI_TransmitReceive() in full duplex mode

