JFDuval/FlexSEA/manage/src/fm_stm32f4xx_hal_spi.c
    (#) Non Blocking mode API's with Interrupt are :
        (++) HAL_SPI_Transmit_IT()in 1Line (simplex) and 2Lines (full duplex) mode
        (++) HAL_SPI_Receive_IT() in 1Line (simplex) and 2Lines (full duplex) mode
        (++) HAL_SPI_TransmitReceive_IT()in full duplex mode
        (++) HAL_SPI_IRQHandler()

    (#) Non Blocking mode functions with DMA are :
        (++) HAL_SPI_Transmit_DMA()in 1Line (simplex) and 2Lines (full duplex) mode
        (++) HAL_SPI_Receive_DMA() in 1Line (simplex) and 2Lines (full duplex) mode
        (++) HAL_SPI_TransmitReceie_DMA() in full duplex mode

    (#) A set of Transfer Complete Callbacks are provided in non Blocking mode:
        (++) HAL_SPI_TxCpltCallback()
        (++) HAL_SPI_RxCpltCallback()
        (++) HAL_SPI_ErrorCallback()
        (++) HAL_SPI_TxRxCpltCallback()

@endverbatim
 * @{
 */

/**
 * @brief  Transmit an amount of data in blocking mode
 * @param  hspi: pointer to a SPI_HandleTypeDef structure that contains
 *                the configuration information for SPI module.
 * @param  pData: pointer to data buffer
 * @param  Size: amount of data to be sent
 * @param  Timeout: Timeout duration
 * @retval HAL status
 */
HAL_StatusTypeDef HAL_SPI_Transmit(SPI_HandleTypeDef *hspi, uint8_t *pData, uint16_t Size, uint32_t Timeout)
{

	if(hspi->State == HAL_SPI_STATE_READY)
	{
		if((pData == NULL ) || (Size == 0))
		{
			return  HAL_ERROR;
		}

		/* Check the parameters */
		assert_param(IS_SPI_DIRECTION_2LINES_OR_1LINE(hspi->Init.Direction));

		/* Process Locked */
		__HAL_LOCK(hspi);

		/* Configure communication */
		hspi->State = HAL_SPI_STATE_BUSY_TX;
		hspi->ErrorCode   = HAL_SPI_ERROR_NONE;

		hspi->pTxBuffPtr = pData;
		hspi->TxXferSize = Size;
		hspi->TxXferCount = Size;

		/*Init field not used in handle to zero */
		hspi->TxISR = 0;
		hspi->RxISR = 0;
		hspi->RxXferSize   = 0;
		hspi->RxXferCount  = 0;

		/* Reset CRC Calculation */
		if(hspi->Init.CRCCalculation == SPI_CRCCALCULATION_ENABLED)
		{
			__HAL_SPI_RESET_CRC(hspi);
		}

		if(hspi->Init.Direction == SPI_DIRECTION_1LINE)
		{
			/* Configure communication direction : 1Line */
			__HAL_SPI_1LINE_TX(hspi);
		}

		/* Check if the SPI is already enabled */
		if((hspi->Instance->CR1 &SPI_CR1_SPE) != SPI_CR1_SPE)
		{
			/* Enable SPI peripheral */
			__HAL_SPI_ENABLE(hspi);
		}

		/* Transmit data in 8 Bit mode */
		if(hspi->Init.DataSize == SPI_DATASIZE_8BIT)
		{
			if((hspi->Init.Mode == SPI_MODE_SLAVE)|| (hspi->TxXferCount == 0x01))
			{
				hspi->Instance->DR = (*hspi->pTxBuffPtr++);
				hspi->TxXferCount--;
			}
			while(hspi->TxXferCount > 0)
			{
				/* Wait until TXE flag is set to send data */
				if(SPI_WaitOnFlagUntilTimeout(hspi, SPI_FLAG_TXE, RESET, Timeout) != HAL_OK)
				{
					return HAL_TIMEOUT;
				}
				hspi->Instance->DR = (*hspi->pTxBuffPtr++);
				hspi->TxXferCount--;
			}
			/* Enable CRC Transmission */
			if(hspi->Init.CRCCalculation == SPI_CRCCALCULATION_ENABLED)
			{
				hspi->Instance->CR1 |= SPI_CR1_CRCNEXT;
			}
		}
		/* Transmit data in 16 Bit mode */
		else
		{
			if((hspi->Init.Mode == SPI_MODE_SLAVE) || (hspi->TxXferCount == 0x01))
			{
				hspi->Instance->DR = *((uint16_t*)hspi->pTxBuffPtr);
				hspi->pTxBuffPtr+=2;
				hspi->TxXferCount--;
			}
			while(hspi->TxXferCount > 0)
			{
				/* Wait until TXE flag is set to send data */
				if(SPI_WaitOnFlagUntilTimeout(hspi, SPI_FLAG_TXE, RESET, Timeout) != HAL_OK)
				{
					return HAL_TIMEOUT;
				}
				hspi->Instance->DR = *((uint16_t*)hspi->pTxBuffPtr);
				hspi->pTxBuffPtr+=2;
				hspi->TxXferCount--;
			}
			/* Enable CRC Transmission */
			if(hspi->Init.CRCCalculation == SPI_CRCCALCULATION_ENABLED)
			{
				hspi->Instance->CR1 |= SPI_CR1_CRCNEXT;
			}
		}

		/* Wait until TXE flag is set to send data */
		if(SPI_WaitOnFlagUntilTimeout(hspi, SPI_FLAG_TXE, RESET, Timeout) != HAL_OK)
		{
			hspi->ErrorCode |= HAL_SPI_ERROR_FLAG;
			return HAL_TIMEOUT;
		}

		/* Wait until Busy flag is reset before disabling SPI */
		if(SPI_WaitOnFlagUntilTimeout(hspi, SPI_FLAG_BSY, SET, Timeout) != HAL_OK)
		{
			hspi->ErrorCode |= HAL_SPI_ERROR_FLAG;
			return HAL_TIMEOUT;
		}

		/* Clear OVERUN flag in 2 Lines communication mode because received is not read */
		if(hspi->Init.Direction == SPI_DIRECTION_2LINES)
		{
			__HAL_SPI_CLEAR_OVRFLAG(hspi);
		}

		hspi->State = HAL_SPI_STATE_READY;

		/* Process Unlocked */
		__HAL_UNLOCK(hspi);

		return HAL_OK;
	}
	else
	{
		return HAL_BUSY;
	}
}

// [ILG]
#if defined ( __GNUC__ )
#pragma GCC diagnostic push
#pragma GCC diagnostic ignored "-Wconversion"
#endif

/**
 * @brief  Receive an amount of data in blocking mode
 * @param  hspi: pointer to a SPI_HandleTypeDef structure that contains
 *                the configuration information for SPI module.
 * @param  pData: pointer to data buffer
 * @param  Size: amount of data to be sent
 * @param  Timeout: Timeout duration
 * @retval HAL status
 */
HAL_StatusTypeDef HAL_SPI_Receive(SPI_HandleTypeDef *hspi, uint8_t *pData, uint16_t Size, uint32_t Timeout)
{
	// [ILG]
#if defined ( __GNUC__ )
#pragma GCC diagnostic push
#pragma GCC diagnostic ignored "-Wunused-but-set-variable"
#endif
	__IO uint16_t tmpreg;
	// [ILG]
#if defined ( __GNUC__ )
#pragma GCC diagnostic pop
#endif

	uint32_t tmp = 0;

	if(hspi->State == HAL_SPI_STATE_READY)
	{
		if((pData == NULL ) || (Size == 0))
		{
			return  HAL_ERROR;
		}

		/* Process Locked */
		__HAL_LOCK(hspi);

		/* Configure communication */
		hspi->State       = HAL_SPI_STATE_BUSY_RX;
		hspi->ErrorCode   = HAL_SPI_ERROR_NONE;

		hspi->pRxBuffPtr  = pData;
		hspi->RxXferSize  = Size;
		hspi->RxXferCount = Size;

		/*Init field not used in handle to zero */
		hspi->RxISR = 0;
		hspi->TxISR = 0;
		hspi->TxXferSize   = 0;
		hspi->TxXferCount  = 0;

		/* Configure communication direction : 1Line */
		if(hspi->Init.Direction == SPI_DIRECTION_1LINE)
		{
			__HAL_SPI_1LINE_RX(hspi);
		}

		/* Reset CRC Calculation */
		if(hspi->Init.CRCCalculation == SPI_CRCCALCULATION_ENABLED)
		{
			__HAL_SPI_RESET_CRC(hspi);
		}

