JFDuval/FlexSEA/manage/src/fm_stm32f4xx_hal_spi.c
		if((hspi->Init.Mode == SPI_MODE_MASTER) && (hspi->Init.Direction == SPI_DIRECTION_2LINES))
		{
			/* Process Unlocked */
			__HAL_UNLOCK(hspi);

			/* Call transmit-receive function to send Dummy data on Tx line and generate clock on CLK line */
			return HAL_SPI_TransmitReceive(hspi, pData, pData, Size, Timeout);
		}

		/* Check if the SPI is already enabled */
		if((hspi->Instance->CR1 &SPI_CR1_SPE) != SPI_CR1_SPE)
		{
			/* Enable SPI peripheral */
			__HAL_SPI_ENABLE(hspi);
		}

		/* Receive data in 8 Bit mode */
		if(hspi->Init.DataSize == SPI_DATASIZE_8BIT)
		{
			while(hspi->RxXferCount > 1)
			{
				/* Wait until RXNE flag is set */
				if(SPI_WaitOnFlagUntilTimeout(hspi, SPI_FLAG_RXNE, RESET, Timeout) != HAL_OK)
				{
					return HAL_TIMEOUT;
				}

				(*hspi->pRxBuffPtr++) = hspi->Instance->DR;
				hspi->RxXferCount--;
			}
			/* Enable CRC Transmission */
			if(hspi->Init.CRCCalculation == SPI_CRCCALCULATION_ENABLED)
			{
				hspi->Instance->CR1 |= SPI_CR1_CRCNEXT;
			}
		}
		/* Receive data in 16 Bit mode */
		else
		{
			while(hspi->RxXferCount > 1)
			{
				/* Wait until RXNE flag is set to read data */
				if(SPI_WaitOnFlagUntilTimeout(hspi, SPI_FLAG_RXNE, RESET, Timeout) != HAL_OK)
				{
					return HAL_TIMEOUT;
				}

				*((uint16_t*)hspi->pRxBuffPtr) = hspi->Instance->DR;
				hspi->pRxBuffPtr+=2;
				hspi->RxXferCount--;
			}
			/* Enable CRC Transmission */
			if(hspi->Init.CRCCalculation == SPI_CRCCALCULATION_ENABLED)
			{
				hspi->Instance->CR1 |= SPI_CR1_CRCNEXT;
			}
		}

		/* Wait until RXNE flag is set */
		if(SPI_WaitOnFlagUntilTimeout(hspi, SPI_FLAG_RXNE, RESET, Timeout) != HAL_OK)
		{
			return HAL_TIMEOUT;
		}

		/* Receive last data in 8 Bit mode */
		if(hspi->Init.DataSize == SPI_DATASIZE_8BIT)
		{
			(*hspi->pRxBuffPtr++) = hspi->Instance->DR;
		}
		/* Receive last data in 16 Bit mode */
		else
		{
			*((uint16_t*)hspi->pRxBuffPtr) = hspi->Instance->DR;
			hspi->pRxBuffPtr+=2;
		}
		hspi->RxXferCount--;

		/* Wait until RXNE flag is set: CRC Received */
		if(hspi->Init.CRCCalculation == SPI_CRCCALCULATION_ENABLED)
		{
			if(SPI_WaitOnFlagUntilTimeout(hspi, SPI_FLAG_RXNE, RESET, Timeout) != HAL_OK)
			{
				hspi->ErrorCode |= HAL_SPI_ERROR_CRC;
				return HAL_TIMEOUT;
			}

			/* Read CRC to Flush RXNE flag */
			tmpreg = hspi->Instance->DR;
		}

		if((hspi->Init.Mode == SPI_MODE_MASTER)&&((hspi->Init.Direction == SPI_DIRECTION_1LINE)||(hspi->Init.Direction == SPI_DIRECTION_2LINES_RXONLY)))
		{
			/* Disable SPI peripheral */
			__HAL_SPI_DISABLE(hspi);
		}

		hspi->State = HAL_SPI_STATE_READY;

		tmp = __HAL_SPI_GET_FLAG(hspi, SPI_FLAG_CRCERR);
		/* Check if CRC error occurred */
		if((hspi->Init.CRCCalculation == SPI_CRCCALCULATION_ENABLED) && (tmp != RESET))
		{
			hspi->ErrorCode |= HAL_SPI_ERROR_CRC;

			/* Reset CRC Calculation */
			__HAL_SPI_RESET_CRC(hspi);

			/* Process Unlocked */
			__HAL_UNLOCK(hspi);

			return HAL_ERROR;
		}

		/* Process Unlocked */
		__HAL_UNLOCK(hspi);

		return HAL_OK;
	}
	else
	{
		return HAL_BUSY;
	}
}

/**
 * @brief  Transmit and Receive an amount of data in blocking mode
 * @param  hspi: pointer to a SPI_HandleTypeDef structure that contains
 *                the configuration information for SPI module.
 * @param  pTxData: pointer to transmission data buffer
 * @param  pRxData: pointer to reception data buffer to be
 * @param  Size: amount of data to be sent
 * @param  Timeout: Timeout duration
 * @retval HAL status
 */
HAL_StatusTypeDef HAL_SPI_TransmitReceive(SPI_HandleTypeDef *hspi, uint8_t *pTxData, uint8_t *pRxData, uint16_t Size, uint32_t Timeout)
{
	// [ILG]
#if defined ( __GNUC__ )
#pragma GCC diagnostic push
#pragma GCC diagnostic ignored "-Wunused-but-set-variable"
#endif
	__IO uint16_t tmpreg;
	// [ILG]
#if defined ( __GNUC__ )
#pragma GCC diagnostic pop
#endif

	uint32_t tmpstate = 0, tmp = 0;

	tmpstate = hspi->State;
	if((tmpstate == HAL_SPI_STATE_READY) || (tmpstate == HAL_SPI_STATE_BUSY_RX))
	{
		if((pTxData == NULL ) || (pRxData == NULL ) || (Size == 0))
		{
			return  HAL_ERROR;
		}

		/* Check the parameters */
		assert_param(IS_SPI_DIRECTION_2LINES(hspi->Init.Direction));

		/* Process Locked */
		__HAL_LOCK(hspi);

		/* Don't overwrite in case of HAL_SPI_STATE_BUSY_RX */
		if(hspi->State == HAL_SPI_STATE_READY)
		{
			hspi->State = HAL_SPI_STATE_BUSY_TX_RX;
		}

		/* Configure communication */
		hspi->ErrorCode   = HAL_SPI_ERROR_NONE;

		hspi->pRxBuffPtr  = pRxData;
		hspi->RxXferSize  = Size;
		hspi->RxXferCount = Size;

		hspi->pTxBuffPtr  = pTxData;
		hspi->TxXferSize  = Size;
		hspi->TxXferCount = Size;

		/*Init field not used in handle to zero */
		hspi->RxISR = 0;
		hspi->TxISR = 0;

		/* Reset CRC Calculation */
		if(hspi->Init.CRCCalculation == SPI_CRCCALCULATION_ENABLED)
		{
			__HAL_SPI_RESET_CRC(hspi);
		}

		/* Check if the SPI is already enabled */
		if((hspi->Instance->CR1 &SPI_CR1_SPE) != SPI_CR1_SPE)
		{
			/* Enable SPI peripheral */
			__HAL_SPI_ENABLE(hspi);
		}

		/* Transmit and Receive data in 16 Bit mode */
		if(hspi->Init.DataSize == SPI_DATASIZE_16BIT)
		{
			if((hspi->Init.Mode == SPI_MODE_SLAVE) || ((hspi->Init.Mode == SPI_MODE_MASTER) && (hspi->TxXferCount == 0x01)))
			{
				hspi->Instance->DR = *((uint16_t*)hspi->pTxBuffPtr);
				hspi->pTxBuffPtr+=2;
				hspi->TxXferCount--;
			}
			if(hspi->TxXferCount == 0)
			{
				/* Enable CRC Transmission */
				if(hspi->Init.CRCCalculation == SPI_CRCCALCULATION_ENABLED)
				{
					hspi->Instance->CR1 |= SPI_CR1_CRCNEXT;
				}

				/* Wait until RXNE flag is set */
				if(SPI_WaitOnFlagUntilTimeout(hspi, SPI_FLAG_RXNE, RESET, Timeout) != HAL_OK)
				{
					return HAL_TIMEOUT;
				}

				*((uint16_t*)hspi->pRxBuffPtr) = hspi->Instance->DR;
				hspi->pRxBuffPtr+=2;
				hspi->RxXferCount--;
			}
			else
			{
				while(hspi->TxXferCount > 0)
				{
					/* Wait until TXE flag is set to send data */
					if(SPI_WaitOnFlagUntilTimeout(hspi, SPI_FLAG_TXE, RESET, Timeout) != HAL_OK)
					{
						return HAL_TIMEOUT;
					}

					hspi->Instance->DR = *((uint16_t*)hspi->pTxBuffPtr);
					hspi->pTxBuffPtr+=2;
					hspi->TxXferCount--;

					/* Enable CRC Transmission */
					if((hspi->TxXferCount == 0) && (hspi->Init.CRCCalculation == SPI_CRCCALCULATION_ENABLED))
					{
						hspi->Instance->CR1 |= SPI_CR1_CRCNEXT;
					}

