JFDuval/FlexSEA/manage/src/fm_stm32f4xx_hal_spi.c
					/* Wait until RXNE flag is set */
					if(SPI_WaitOnFlagUntilTimeout(hspi, SPI_FLAG_RXNE, RESET, Timeout) != HAL_OK)
					{
						return HAL_TIMEOUT;
					}

					*((uint16_t*)hspi->pRxBuffPtr) = hspi->Instance->DR;
					hspi->pRxBuffPtr+=2;
					hspi->RxXferCount--;
				}
				/* Receive the last byte */
				if(hspi->Init.Mode == SPI_MODE_SLAVE)
				{
					/* Wait until RXNE flag is set */
					if(SPI_WaitOnFlagUntilTimeout(hspi, SPI_FLAG_RXNE, RESET, Timeout) != HAL_OK)
					{
						return HAL_TIMEOUT;
					}

					*((uint16_t*)hspi->pRxBuffPtr) = hspi->Instance->DR;
					hspi->pRxBuffPtr+=2;
					hspi->RxXferCount--;
				}
			}
		}
		/* Transmit and Receive data in 8 Bit mode */
		else
		{
			if((hspi->Init.Mode == SPI_MODE_SLAVE) || ((hspi->Init.Mode == SPI_MODE_MASTER) && (hspi->TxXferCount == 0x01)))
			{
				hspi->Instance->DR = (*hspi->pTxBuffPtr++);
				hspi->TxXferCount--;
			}
			if(hspi->TxXferCount == 0)
			{
				/* Enable CRC Transmission */
				if(hspi->Init.CRCCalculation == SPI_CRCCALCULATION_ENABLED)
				{
					hspi->Instance->CR1 |= SPI_CR1_CRCNEXT;
				}

				/* Wait until RXNE flag is set */
				if(SPI_WaitOnFlagUntilTimeout(hspi, SPI_FLAG_RXNE, RESET, Timeout) != HAL_OK)
				{
					return HAL_TIMEOUT;
				}

				(*hspi->pRxBuffPtr) = hspi->Instance->DR;
				hspi->RxXferCount--;
			}
			else
			{
				while(hspi->TxXferCount > 0)
				{
					/* Wait until TXE flag is set to send data */
					if(SPI_WaitOnFlagUntilTimeout(hspi, SPI_FLAG_TXE, RESET, Timeout) != HAL_OK)
					{
						return HAL_TIMEOUT;
					}

					hspi->Instance->DR = (*hspi->pTxBuffPtr++);
					hspi->TxXferCount--;

					/* Enable CRC Transmission */
					if((hspi->TxXferCount == 0) && (hspi->Init.CRCCalculation == SPI_CRCCALCULATION_ENABLED))
					{
						hspi->Instance->CR1 |= SPI_CR1_CRCNEXT;
					}

					/* Wait until RXNE flag is set */
					if(SPI_WaitOnFlagUntilTimeout(hspi, SPI_FLAG_RXNE, RESET, Timeout) != HAL_OK)
					{
						return HAL_TIMEOUT;
					}

					(*hspi->pRxBuffPtr++) = hspi->Instance->DR;
					hspi->RxXferCount--;
				}
				if(hspi->Init.Mode == SPI_MODE_SLAVE)
				{
					/* Wait until RXNE flag is set */
					if(SPI_WaitOnFlagUntilTimeout(hspi, SPI_FLAG_RXNE, RESET, Timeout) != HAL_OK)
					{
						return HAL_TIMEOUT;
					}

					(*hspi->pRxBuffPtr++) = hspi->Instance->DR;
					hspi->RxXferCount--;
				}
			}
		}

		/* Read CRC from DR to close CRC calculation process */
		if(hspi->Init.CRCCalculation == SPI_CRCCALCULATION_ENABLED)
		{
			/* Wait until RXNE flag is set */
			if(SPI_WaitOnFlagUntilTimeout(hspi, SPI_FLAG_RXNE, RESET, Timeout) != HAL_OK)
			{
				hspi->ErrorCode |= HAL_SPI_ERROR_CRC;
				return HAL_TIMEOUT;
			}
			/* Read CRC */
			tmpreg = hspi->Instance->DR;
		}

		/* Wait until Busy flag is reset before disabling SPI */
		if(SPI_WaitOnFlagUntilTimeout(hspi, SPI_FLAG_BSY, SET, Timeout) != HAL_OK)
		{
			hspi->ErrorCode |= HAL_SPI_ERROR_FLAG;
			return HAL_TIMEOUT;
		}

		hspi->State = HAL_SPI_STATE_READY;

		tmp = __HAL_SPI_GET_FLAG(hspi, SPI_FLAG_CRCERR);
		/* Check if CRC error occurred */
		if((hspi->Init.CRCCalculation == SPI_CRCCALCULATION_ENABLED) && (tmp != RESET))
		{
			hspi->ErrorCode |= HAL_SPI_ERROR_CRC;

			/* Reset CRC Calculation */
			if(hspi->Init.CRCCalculation == SPI_CRCCALCULATION_ENABLED)
			{
				__HAL_SPI_RESET_CRC(hspi);
			}

			/* Process Unlocked */
			__HAL_UNLOCK(hspi);

			return HAL_ERROR;
		}

		/* Process Unlocked */
		__HAL_UNLOCK(hspi);

		return HAL_OK;
	}
	else
	{
		return HAL_BUSY;
	}
}

// [ILG]
#if defined ( __GNUC__ )
#pragma GCC diagnostic pop
#endif

/**
 * @brief  Transmit an amount of data in no-blocking mode with Interrupt
 * @param  hspi: pointer to a SPI_HandleTypeDef structure that contains
 *                the configuration information for SPI module.
 * @param  pData: pointer to data buffer
 * @param  Size: amount of data to be sent
 * @retval HAL status
 */
HAL_StatusTypeDef HAL_SPI_Transmit_IT(SPI_HandleTypeDef *hspi, uint8_t *pData, uint16_t Size)
{
	// check if a transmission is already going on; it's ok to start during a reception though
	if (hspi->State == HAL_SPI_STATE_BUSY_TX || hspi->State == HAL_SPI_STATE_BUSY_TX_RX)
	{
		return HAL_BUSY;
	}
	else
	{
		if((pData == NULL) || (Size == 0))
		{
			return  HAL_ERROR;
		}

		/* Check the parameters */
		assert_param(IS_SPI_DIRECTION_2LINES_OR_1LINE(hspi->Init.Direction));

		/* Process Locked */
		__HAL_LOCK(hspi);

		if(hspi->State == HAL_SPI_STATE_READY)
		{
			hspi->State = HAL_SPI_STATE_BUSY_TX;
		}
		if(hspi->State == HAL_SPI_STATE_BUSY_RX)
		{
			hspi->State = HAL_SPI_STATE_BUSY_TX_RX;
		}

		/* Configure communication */

		// Reset the error code
		hspi->ErrorCode    = HAL_SPI_ERROR_NONE;

		hspi->TxISR = &SPI_TxISR;
		hspi->pTxBuffPtr   = pData;
		hspi->TxXferSize   = Size;
		hspi->TxXferCount  = Size;

		// don't change RxISR, RxXferSize, or RxXferCount

		/* Configure communication direction : 1Line */
		if(hspi->Init.Direction == SPI_DIRECTION_1LINE)
		{
			__HAL_SPI_1LINE_TX(hspi);
		}

		/* Reset CRC Calculation */
		if(hspi->Init.CRCCalculation == SPI_CRCCALCULATION_ENABLED)
		{
			__HAL_SPI_RESET_CRC(hspi);
		}

		if (hspi->Init.Direction == SPI_DIRECTION_2LINES)
		{
			__HAL_SPI_ENABLE_IT(hspi, (SPI_IT_TXE));
		}else
		{
			/* Enable TXE and ERR interrupt */
			__HAL_SPI_ENABLE_IT(hspi, (SPI_IT_TXE | SPI_IT_ERR));
		}
		/* Process Unlocked */
		__HAL_UNLOCK(hspi);

		/* Check if the SPI is already enabled */
		if((hspi->Instance->CR1 &SPI_CR1_SPE) != SPI_CR1_SPE)
		{
			/* Enable SPI peripheral */
			__HAL_SPI_ENABLE(hspi);
		}

		return HAL_OK;
	}
}

/**
 * @brief  Start an interrupt for receiving an amount of data in no-blocking
 * @param  hspi: pointer to a SPI_HandleTypeDef structure that contains
 *                the configuration information for SPI module.
 * @param  pData: pointer to data buffer
 * @param  Size: amount of data to be sent
 * @retval HAL status
 */
HAL_StatusTypeDef HAL_Start_SPI_Receiving_IT(SPI_HandleTypeDef *hspi, uint8_t *pData, uint16_t Size)
{
	if((pData == NULL) || (Size == 0))
	{
		return  HAL_ERROR;
	}

	/* Process Locked */
	__HAL_LOCK(hspi);

	/* Configure communication */

	// indicate that the SPI state is now BUSY_RX (in addition to whatever the state was before)
	if(hspi->State == HAL_SPI_STATE_READY)
	{
		hspi->State = HAL_SPI_STATE_BUSY_RX;
	}
	if(hspi->State == HAL_SPI_STATE_BUSY_TX)
	{
		hspi->State = HAL_SPI_STATE_BUSY_TX_RX;
	}

	// clear the error code if there was one previously
	hspi->ErrorCode    = HAL_SPI_ERROR_NONE;

	// set the Rx handler, where it will store data, and how much data it will store
	hspi->RxISR = &SPI_RxISR;
	hspi->pRxBuffPtr   = pData;
	hspi->RxXferSize   = Size;
	hspi->RxXferCount  = Size ;

	// no need to change TxISR, TxXferSize, or TxXferCount

	/* Configure communication direction : 1Line */
	if(hspi->Init.Direction == SPI_DIRECTION_1LINE)
	{
		__HAL_SPI_1LINE_RX(hspi);
	}
	else if((hspi->Init.Direction == SPI_DIRECTION_2LINES) && (hspi->Init.Mode == SPI_MODE_MASTER))
	{
		/* Process Unlocked */
		__HAL_UNLOCK(hspi);

		// error because master mode not yet implemented
		return  HAL_ERROR;
	}

	/* Reset CRC Calculation */
	if(hspi->Init.CRCCalculation == SPI_CRCCALCULATION_ENABLED)
	{
		__HAL_SPI_RESET_CRC(hspi);
	}

	/* Enable RXNE and ERR interrupt */
	__HAL_SPI_ENABLE_IT(hspi, (SPI_IT_RXNE | SPI_IT_ERR));

	/* Process Unlocked */
	__HAL_UNLOCK(hspi);

	/* Note : The SPI must be enabled after unlocking current process
              to avoid the risk of SPI interrupt handle execution before current
              process unlock */

	/* Check if the SPI is already enabled */
	if((hspi->Instance->CR1 &SPI_CR1_SPE) != SPI_CR1_SPE)
	{
		/* Enable SPI peripheral */
		__HAL_SPI_ENABLE(hspi);
	}

	return HAL_OK;
}

/**
 * @brief  Read the most recent frame of data from the SPI reception buffer
 * @param  hspi: pointer to a SPI_HandleTypeDef structure that contains
 *                the configuration information for SPI module.
 * @param  pSPIBuffer: pointer for the buffer that the hspi is writing to (the hspi handle
 * 				doesn't keep track of this, only the current pointer it's writing to
 * @param  pData: pointer for data to be read to; note that hspi->RxXferSize data will be read
 * @retval HAL status
 */
HAL_StatusTypeDef HAL_SPI_Read_IT(SPI_HandleTypeDef *hspi, uint8_t pSPIBuffer[], uint8_t pData[])
{
	// copy the data over
	//strncpy(pSPIBuffer, pData, 24);
	/*
	for (uint16_t i=0; i<24; i++)
	{
		pData[i] = pSPIBuffer[i];
	}
	 */

	// delete the data
	for (uint16_t j=0; j<24; j++)
	{
		pSPIBuffer[j] = 0;
	}

	// reset the pointer

	return HAL_OK;

