JFDuval/FlexSEA/manage/src/fm_stm32f4xx_hal_spi.c
}

/**
 * @brief  Transmit and Receive an amount of data in no-blocking mode with Interrupt
 * @param  hspi: pointer to a SPI_HandleTypeDef structure that contains
 *                the configuration information for SPI module.
 * @param  pTxData: pointer to transmission data buffer
 * @param  pRxData: pointer to reception data buffer to be
 * @param  Size: amount of data to be sent
 * @retval HAL status
 */
HAL_StatusTypeDef HAL_SPI_TransmitReceive_IT(SPI_HandleTypeDef *hspi, uint8_t *pTxData, uint8_t *pRxData, uint16_t Size)
{
	uint32_t tmpstate = 0;

	tmpstate = hspi->State;
	if((tmpstate == HAL_SPI_STATE_READY) || \
			((hspi->Init.Mode == SPI_MODE_MASTER) && (hspi->Init.Direction == SPI_DIRECTION_2LINES) && (tmpstate == HAL_SPI_STATE_BUSY_RX)))
	{
		if((pTxData == NULL ) || (pRxData == NULL ) || (Size == 0))
		{
			return  HAL_ERROR;
		}

		/* Check the parameters */
		assert_param(IS_SPI_DIRECTION_2LINES(hspi->Init.Direction));

		/* Process locked */
		__HAL_LOCK(hspi);

		/* Don't overwrite in case of HAL_SPI_STATE_BUSY_RX */
		if(hspi->State != HAL_SPI_STATE_BUSY_RX)
		{
			hspi->State = HAL_SPI_STATE_BUSY_TX_RX;
		}

		/* Configure communication */
		hspi->ErrorCode    = HAL_SPI_ERROR_NONE;

		hspi->TxISR = &SPI_TxISR;
		hspi->pTxBuffPtr   = pTxData;
		hspi->TxXferSize   = Size;
		hspi->TxXferCount  = Size;

		hspi->RxISR = &SPI_2LinesRxISR;
		hspi->pRxBuffPtr   = pRxData;
		hspi->RxXferSize   = Size;
		hspi->RxXferCount  = Size;

		/* Reset CRC Calculation */
		if(hspi->Init.CRCCalculation == SPI_CRCCALCULATION_ENABLED)
		{
			__HAL_SPI_RESET_CRC(hspi);
		}

		/* Enable TXE, RXNE and ERR interrupt */
		__HAL_SPI_ENABLE_IT(hspi, (SPI_IT_TXE | SPI_IT_RXNE | SPI_IT_ERR));

		/* Process Unlocked */
		__HAL_UNLOCK(hspi);

		/* Check if the SPI is already enabled */
		if((hspi->Instance->CR1 &SPI_CR1_SPE) != SPI_CR1_SPE)
		{
			/* Enable SPI peripheral */
			__HAL_SPI_ENABLE(hspi);
		}

		return HAL_OK;
	}
	else
	{
		return HAL_BUSY;
	}
}

void HAL_SPI_IRQHandler(SPI_HandleTypeDef *hspi)
{
	uint32_t tmp1 = 0, tmp2 = 0, tmp3 = 0;

	tmp1 = __HAL_SPI_GET_FLAG(hspi, SPI_FLAG_RXNE);
	tmp2 = __HAL_SPI_GET_IT_SOURCE(hspi, SPI_IT_RXNE);
	tmp3 = __HAL_SPI_GET_FLAG(hspi, SPI_FLAG_OVR);
	/* SPI in mode Receiver and Overrun not occurred ---------------------------*/
	if((tmp1 != RESET) && (tmp2 != RESET) && (tmp3 == RESET))
	{
		hspi->RxISR(hspi);
		return;
	}

	tmp1 = __HAL_SPI_GET_FLAG(hspi, SPI_FLAG_TXE);
	tmp2 = __HAL_SPI_GET_IT_SOURCE(hspi, SPI_IT_TXE);
	/* SPI in mode Tramitter ---------------------------------------------------*/
	if((tmp1 != RESET) && (tmp2 != RESET))
	{
		hspi->TxISR(hspi);
		return;
	}

	if(__HAL_SPI_GET_IT_SOURCE(hspi, SPI_IT_ERR) != RESET)
	{
		/* SPI CRC error interrupt occurred ---------------------------------------*/
		if(__HAL_SPI_GET_FLAG(hspi, SPI_FLAG_CRCERR) != RESET)
		{
			hspi->ErrorCode |= HAL_SPI_ERROR_CRC;
			__HAL_SPI_CLEAR_CRCERRFLAG(hspi);
		}
		/* SPI Mode Fault error interrupt occurred --------------------------------*/
		if(__HAL_SPI_GET_FLAG(hspi, SPI_FLAG_MODF) != RESET)
		{
			hspi->ErrorCode |= HAL_SPI_ERROR_MODF;
			__HAL_SPI_CLEAR_MODFFLAG(hspi);
		}

		/* SPI Overrun error interrupt occurred -----------------------------------*/
		if(__HAL_SPI_GET_FLAG(hspi, SPI_FLAG_OVR) != RESET)
		{
			if(hspi->State != HAL_SPI_STATE_BUSY_TX)
			{
				hspi->ErrorCode |= HAL_SPI_ERROR_OVR;
				__HAL_SPI_CLEAR_OVRFLAG(hspi);
			}
		}

		/* SPI Frame error interrupt occurred -------------------------------------*/
		if(__HAL_SPI_GET_FLAG(hspi, SPI_FLAG_FRE) != RESET)
		{
			hspi->ErrorCode |= HAL_SPI_ERROR_FRE;
			__HAL_SPI_CLEAR_FREFLAG(hspi);
		}

		/* Call the Error call Back in case of Errors */
		if(hspi->ErrorCode!=HAL_SPI_ERROR_NONE)
		{
			hspi->State = HAL_SPI_STATE_READY;
			HAL_SPI_ErrorCallback(hspi);
		}
	}
}

// [ILG]
#if defined ( __GNUC__ )
#pragma GCC diagnostic push
#pragma GCC diagnostic ignored "-Wunused-parameter"
#endif

/**
 * @brief Tx Transfer completed callbacks
 * @param  hspi: pointer to a SPI_HandleTypeDef structure that contains
 *                the configuration information for SPI module.
 * @retval None
 */
__weak void HAL_SPI_TxCpltCallback(SPI_HandleTypeDef *hspi)
{
	/* NOTE : This function Should not be modified, when the callback is needed,
            the HAL_SPI_TxCpltCallback could be implenetd in the user file
	 */
}

/**
 * @brief Rx Transfer completed callbacks
 * @param  hspi: pointer to a SPI_HandleTypeDef structure that contains
 *                the configuration information for SPI module.
 * @retval None
 */
__weak void HAL_SPI_RxCpltCallback(SPI_HandleTypeDef *hspi)
{
	/* NOTE : This function Should not be modified, when the callback is needed,
            the HAL_SPI_RxCpltCallback() could be implenetd in the user file
	 */
}

/**
 * @brief Tx and Rx Transfer completed callbacks
 * @param  hspi: pointer to a SPI_HandleTypeDef structure that contains
 *                the configuration information for SPI module.
 * @retval None
 */
__weak void HAL_SPI_TxRxCpltCallback(SPI_HandleTypeDef *hspi)
{
	/* NOTE : This function Should not be modified, when the callback is needed,
            the HAL_SPI_TxRxCpltCallback() could be implenetd in the user file
	 */
}

/**
 * @brief Tx Half Transfer completed callbacks
 * @param  hspi: pointer to a SPI_HandleTypeDef structure that contains
 *                the configuration information for SPI module.
 * @retval None
 */
__weak void HAL_SPI_TxHalfCpltCallback(SPI_HandleTypeDef *hspi)
{
	/* NOTE : This function Should not be modified, when the callback is needed,
            the HAL_SPI_TxHalfCpltCallback could be implenetd in the user file
	 */
}

/**
 * @brief Rx Half Transfer completed callbacks
 * @param  hspi: pointer to a SPI_HandleTypeDef structure that contains
 *                the configuration information for SPI module.
 * @retval None
 */
__weak void HAL_SPI_RxHalfCpltCallback(SPI_HandleTypeDef *hspi)
{
	/* NOTE : This function Should not be modified, when the callback is needed,
            the HAL_SPI_RxHalfCpltCallback() could be implenetd in the user file
	 */
}

/**
 * @brief Tx and Rx Transfer completed callbacks
 * @param  hspi: pointer to a SPI_HandleTypeDef structure that contains
 *                the configuration information for SPI module.
 * @retval None
 */
__weak void HAL_SPI_TxRxHalfCpltCallback(SPI_HandleTypeDef *hspi)
{
	/* NOTE : This function Should not be modified, when the callback is needed,
            the HAL_SPI_TxRxHalfCpltCallback() could be implenetd in the user file
	 */
}

/**
 * @brief SPI error callbacks
 * @param  hspi: pointer to a SPI_HandleTypeDef structure that contains
 *                the configuration information for SPI module.
 * @retval None
 */
__weak void HAL_SPI_ErrorCallback(SPI_HandleTypeDef *hspi)
{
	/* NOTE : - This function Should not be modified, when the callback is needed,
            the HAL_SPI_ErrorCallback() could be implenetd in the user file.
            - The ErrorCode parameter in the hspi handle is updated by the SPI processes
            and user can use HAL_SPI_GetError() API to check the latest error occurred.
	 */
}

// [ILG]
#if defined ( __GNUC__ )
#pragma GCC diagnostic pop
#endif

/**
 * @}
 */

/** @defgroup SPI_Group3 Peripheral State and Errors functions 
 *  @brief   SPI control functions
 *
@verbatim
 ===============================================================================
                      ##### Peripheral State and Errors functions #####
 ===============================================================================  
    [..]
    This subsection provides a set of functions allowing to control the SPI.
     (+) HAL_SPI_GetState() API can be helpful to check in run-time the state of the SPI peripheral
     (+) HAL_SPI_GetError() check in run-time Errors occurring during communication
@endverbatim
 * @{
 */

/**
 * @brief  Return the SPI state
 * @param  hspi: pointer to a SPI_HandleTypeDef structure that contains
 *                the configuration information for SPI module.
 * @retval HAL state
 */
HAL_SPI_StateTypeDef HAL_SPI_GetState(SPI_HandleTypeDef *hspi)
{
	return hspi->State;
}

/**
 * @brief  Return the SPI error code
 * @param  hspi: pointer to a SPI_HandleTypeDef structure that contains
 *                the configuration information for SPI module.
 * @retval SPI Error Code
 */
HAL_SPI_ErrorTypeDef HAL_SPI_GetError(SPI_HandleTypeDef *hspi)
{
	return hspi->ErrorCode;
}

/**
 * @}
 */

/**
 * @brief  Interrupt Handler to close Tx transfer
 * @param  hspi: pointer to a SPI_HandleTypeDef structure that contains
 *                the configuration information for SPI module.
 * @retval void
 */
static void SPI_TxCloseIRQHandler(SPI_HandleTypeDef *hspi)
{
	/* Wait until TXE flag is set to send data */
	if(SPI_WaitOnFlagUntilTimeout(hspi, SPI_FLAG_TXE, RESET, SPI_TIMEOUT_VALUE) != HAL_OK)
	{
		hspi->ErrorCode |= HAL_SPI_ERROR_FLAG;
	}

	/* Disable TXE interrupt */
	__HAL_SPI_DISABLE_IT(hspi, (SPI_IT_TXE ));

	/* Disable ERR interrupt if Receive process is finished */
	if(__HAL_SPI_GET_IT_SOURCE(hspi, SPI_IT_RXNE) == RESET)
	{
		__HAL_SPI_DISABLE_IT(hspi, (SPI_IT_ERR));

