JFDuval/FlexSEA/manage/src/fm_stm32f4xx_hal_spi.c
		/* Wait until Busy flag is reset before disabling SPI */
		if(SPI_WaitOnFlagUntilTimeout(hspi, SPI_FLAG_BSY, SET, SPI_TIMEOUT_VALUE) != HAL_OK)
		{
			hspi->ErrorCode |= HAL_SPI_ERROR_FLAG;
		}

		/* Clear OVERUN flag in 2 Lines communication mode because received is not read */
		if(hspi->Init.Direction == SPI_DIRECTION_2LINES)
		{
			__HAL_SPI_CLEAR_OVRFLAG(hspi);
		}

		/* Check if Errors has been detected during transfer */
		if(hspi->ErrorCode !=  HAL_SPI_ERROR_NONE)
		{
			/* Set state to READY before run the Callback Complete */
			hspi->State = HAL_SPI_STATE_READY;
			/* Call Error call back in case of Error */
			HAL_SPI_ErrorCallback(hspi);
		}
	}
	else
	{
		// don't disable ERR and instead just do the Tx callback

		/* Check if we are in Tx or in Rx/Tx Mode */
		if(hspi->State == HAL_SPI_STATE_BUSY_TX_RX)
		{
			/* Set state to Rx that Rx can complete, then run Callback Complete */
			hspi->State = HAL_SPI_STATE_BUSY_RX;
		}
		else
		{
			/* Set state to READY before run the Callback Complete */
			hspi->State = HAL_SPI_STATE_READY;
		}
		HAL_SPI_TxCpltCallback(hspi);
	}
}

/**
 * @brief  Interrupt Handler to transmit amount of data in no-blocking mode
 * @param  hspi: pointer to a SPI_HandleTypeDef structure that contains
 *                the configuration information for SPI module.
 * @retval void
 */
static void SPI_TxISR(SPI_HandleTypeDef *hspi)
{
	/* Transmit data in 8 Bit mode */
	if(hspi->Init.DataSize == SPI_DATASIZE_8BIT)
	{
		hspi->Instance->DR = (*hspi->pTxBuffPtr++);
	}
	/* Transmit data in 16 Bit mode */
	else
	{
		hspi->Instance->DR = *((uint16_t*)hspi->pTxBuffPtr);
		hspi->pTxBuffPtr+=2;
	}
	hspi->TxXferCount--;

	if(hspi->TxXferCount == 0)
	{
		if(hspi->Init.CRCCalculation == SPI_CRCCALCULATION_ENABLED)
		{
			/* calculate and transfer CRC on Tx line */
			hspi->Instance->CR1 |= SPI_CR1_CRCNEXT;
		}
		SPI_TxCloseIRQHandler(hspi);
	}
}

// [ILG]
#if defined ( __GNUC__ )
#pragma GCC diagnostic push
#pragma GCC diagnostic ignored "-Wconversion"
#endif

/**
 * @brief  Interrupt Handler to close Rx transfer
 * @param  hspi: pointer to a SPI_HandleTypeDef structure that contains
 *                the configuration information for SPI module.
 * @retval void
 */
static void SPI_RxCloseIRQHandler(SPI_HandleTypeDef *hspi)
{
	// [ILG]
#if defined ( __GNUC__ )
#pragma GCC diagnostic push
#pragma GCC diagnostic ignored "-Wunused-but-set-variable"
#endif
	__IO uint16_t tmpreg;
	// [ILG]
#if defined ( __GNUC__ )
#pragma GCC diagnostic pop
#endif

	if(hspi->Init.CRCCalculation == SPI_CRCCALCULATION_ENABLED)
	{
		/* Wait until RXNE flag is set to send data */
		if(SPI_WaitOnFlagUntilTimeout(hspi, SPI_FLAG_RXNE, RESET, SPI_TIMEOUT_VALUE) != HAL_OK)
		{
			hspi->ErrorCode |= HAL_SPI_ERROR_FLAG;
		}

		/* Read CRC to reset RXNE flag */
		tmpreg = hspi->Instance->DR;

		/* Wait until RXNE flag is set to send data */
		if(SPI_WaitOnFlagUntilTimeout(hspi, SPI_FLAG_RXNE, SET, SPI_TIMEOUT_VALUE) != HAL_OK)
		{
			hspi->ErrorCode |= HAL_SPI_ERROR_FLAG;
		}

		/* Check if CRC error occurred */
		if(__HAL_SPI_GET_FLAG(hspi, SPI_FLAG_CRCERR) != RESET)
		{
			hspi->ErrorCode |= HAL_SPI_ERROR_CRC;

			/* Reset CRC Calculation */
			__HAL_SPI_RESET_CRC(hspi);
		}
	}

	/* Disable RXNE and ERR interrupt */
	__HAL_SPI_DISABLE_IT(hspi, (SPI_IT_RXNE));

	/* if Transmit process is finished */
	if(__HAL_SPI_GET_IT_SOURCE(hspi, SPI_IT_TXE) == RESET)
	{
		/* Disable ERR interrupt */
		__HAL_SPI_DISABLE_IT(hspi, (SPI_IT_ERR));

		if((hspi->Init.Mode == SPI_MODE_MASTER)&&((hspi->Init.Direction == SPI_DIRECTION_1LINE)||(hspi->Init.Direction == SPI_DIRECTION_2LINES_RXONLY)))
		{
			/* Disable SPI peripheral */
			__HAL_SPI_DISABLE(hspi);
		}

		/* Check if Errors has been detected during transfer */
		if(hspi->ErrorCode ==  HAL_SPI_ERROR_NONE)
		{
			/* Check if we are in Rx or in Rx/Tx Mode */
			if(hspi->State == HAL_SPI_STATE_BUSY_TX_RX)
			{
				/* Set state to READY before run the Callback Complete */
				hspi->State = HAL_SPI_STATE_BUSY_TX;
				HAL_SPI_RxCpltCallback(hspi);
			}
			else
			{
				/* Set state to READY before run the Callback Complete */
				hspi->State = HAL_SPI_STATE_READY;
				HAL_SPI_RxCpltCallback(hspi);
			}
		}
		else
		{
			/* Set state to READY before run the Callback Complete */
			hspi->State = HAL_SPI_STATE_READY;
			/* Call Error call back in case of Error */
			HAL_SPI_ErrorCallback(hspi);
		}
	}
}

/**
 * @brief  Interrupt Handler to receive amount of data in 2Lines mode
 * @param  hspi: pointer to a SPI_HandleTypeDef structure that contains
 *                the configuration information for SPI module.
 * @retval void
 */
static void SPI_2LinesRxISR(SPI_HandleTypeDef *hspi)
{
	/* Receive data in 8 Bit mode */
	if(hspi->Init.DataSize == SPI_DATASIZE_8BIT)
	{
		(*hspi->pRxBuffPtr++) = hspi->Instance->DR;
	}
	/* Receive data in 16 Bit mode */
	else
	{
		*((uint16_t*)hspi->pRxBuffPtr) = hspi->Instance->DR;
		hspi->pRxBuffPtr+=2;
	}
	hspi->RxXferCount--;

	if(hspi->RxXferCount==0)
	{
		SPI_RxCloseIRQHandler(hspi);
	}
}

/**
 * @brief  Interrupt Handler to receive amount of data in no-blocking mode
 * @param  hspi: pointer to a SPI_HandleTypeDef structure that contains
 *                the configuration information for SPI module.
 * @retval void
 */
static void SPI_RxISR(SPI_HandleTypeDef *hspi)
{
	if(hspi->RxXferCount > 0)
	{
		// get a lock on hspi since we'll be modifying its attributes
		/* Receive data in 8 Bit mode */
		if(hspi->Init.DataSize == SPI_DATASIZE_8BIT)
		{
			(*hspi->pRxBuffPtr++) = hspi->Instance->DR;
		}
		/* Receive data in 16 Bit mode */
		else
		{
			*((uint16_t*)hspi->pRxBuffPtr) = hspi->Instance->DR;
			hspi->pRxBuffPtr+=2;
		}

		// a byte has been received, so decrement the quota of bytes to be received
		hspi->RxXferCount--;

		/* Enable CRC Transmission */
		if((hspi->RxXferCount == 1) && (hspi->Init.CRCCalculation == SPI_CRCCALCULATION_ENABLED))
		{
			/* Set CRC Next to calculate CRC on Rx side */
			hspi->Instance->CR1 |= SPI_CR1_CRCNEXT;
		}

		if(hspi->RxXferCount == 0)
		{
			// The buffer should be cleared and pointer reset before this state is reached
			//Error_Handler();
		}
	}
	// else, continue running, but don't copy anything
}

// [ILG]
#if defined ( __GNUC__ )
#pragma GCC diagnostic pop
#endif

/**
 * @brief This function handles SPI Communication Timeout.
 * @param  hspi: pointer to a SPI_HandleTypeDef structure that contains
 *                the configuration information for SPI module.
 * @retval HAL status
 */
static HAL_StatusTypeDef SPI_WaitOnFlagUntilTimeout(SPI_HandleTypeDef *hspi, uint32_t Flag, FlagStatus Status, uint32_t Timeout)  
{
	uint32_t tickstart = 0;

	/* Get tick */
	tickstart = HAL_GetTick();

	/* Wait until flag is set */
	if(Status == RESET)
	{
		while(__HAL_SPI_GET_FLAG(hspi, Flag) == RESET)
		{
			if(Timeout != HAL_MAX_DELAY)
			{
				if((Timeout == 0)||((HAL_GetTick() - tickstart ) > Timeout))
				{
					/* Disable the SPI and reset the CRC: the CRC value should be cleared
             on both master and slave sides in order to resynchronize the master
             and slave for their respective CRC calculation */

					/* Disable TXE, RXNE and ERR interrupts for the interrupt process */
					__HAL_SPI_DISABLE_IT(hspi, (SPI_IT_TXE | SPI_IT_RXNE | SPI_IT_ERR));

					/* Disable SPI peripheral */
					__HAL_SPI_DISABLE(hspi);

					/* Reset CRC Calculation */
					if(hspi->Init.CRCCalculation == SPI_CRCCALCULATION_ENABLED)
					{
						__HAL_SPI_RESET_CRC(hspi);
					}

					hspi->State= HAL_SPI_STATE_READY;

					/* Process Unlocked */
					__HAL_UNLOCK(hspi);

					return HAL_TIMEOUT;
				}
			}
		}
	}
	else
	{
		while(__HAL_SPI_GET_FLAG(hspi, Flag) != RESET)
		{
			if(Timeout != HAL_MAX_DELAY)
			{
				if((Timeout == 0)||((HAL_GetTick() - tickstart ) > Timeout))
				{
					/* Disable the SPI and reset the CRC: the CRC value should be cleared
             on both master and slave sides in order to resynchronize the master
             and slave for their respective CRC calculation */

					/* Disable TXE, RXNE and ERR interrupts for the interrupt process */
					__HAL_SPI_DISABLE_IT(hspi, (SPI_IT_TXE | SPI_IT_RXNE | SPI_IT_ERR));

					/* Disable SPI peripheral */
					__HAL_SPI_DISABLE(hspi);

					/* Reset CRC Calculation */
					if(hspi->Init.CRCCalculation == SPI_CRCCALCULATION_ENABLED)
					{
						__HAL_SPI_RESET_CRC(hspi);
					}

					hspi->State= HAL_SPI_STATE_READY;

					/* Process Unlocked */
					__HAL_UNLOCK(hspi);

					return HAL_TIMEOUT;
				}
			}
		}
	}
	return HAL_OK;
}


/**
 * @}
 */

#endif /* HAL_SPI_MODULE_ENABLED */
/**
 * @}
 */

/**
 * @}
 */

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
